# Homework:  Lesson 4. Task 4

"""
Представлен  список  чисел.  Определить  элементы  списка,  не  имеющие  повторений.
Сформировать  итоговый массив чисел, соответствующих требованию. Элементы вывести в
порядке  их  следования  в  исходном  списке.  Для  выполнения  задания  обязательно
использовать генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]
"""

data = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
processed_data = [i for i in data if data.count(i) == 1]

print(data)
print(processed_data)
