# ===================================
# Lesson 2
# Homework. Task 3
# ===================================

x = input('Введите целое число, обозначающее месяц года: ')
se = {'1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'}
if not x in se:
    print('Поддержка Клингонских месяцев будет доступна в следующем патче')
    print('В текущей версии поддерживается только ввод чисел от 1 до 12.')
    exit()

di = {'1': "зима", '2': "зима", '3': "весна", '4': "весна", '5': "весна", '6': "лето",
      '7': "лето", '8': "лето", '9': "осень", '10': "осень", '11': "осень", '12': "зима"}
li = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]

print(f"Согласно календарю дикшинов это {di[x]}")
print(f"Согласно календарю листианцев это {li[int(x)-1]}")